---
kind: property
id: P:Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs.PaneId
source: html/d5615ae0-f59c-42ab-e16d-f76f663243e3.htm
---
# Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs.PaneId Property

The identifier for dockable pane.

## Syntax (C#)
```csharp
public DockablePaneId PaneId { get; }
```